Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
policy/service-role/AWSGlueServiceRole"
      + role       = "glue_role"
    }

  # module.sbeacon.aws_lambda_layer_version.binaries_layer will be created
  + resource "aws_lambda_layer_version" "binaries_layer" {
      + arn                         = (known after apply)
      + code_sha256                 = (known after apply)
      + compatible_runtimes         = [
          + "python3.12",
        ]
      + created_date                = (known after apply)
      + filename                    = "sbeacon/binaries.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "sbeacon_backend_binaries_layer"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIGetConfiguration will be created
  + resource "aws_lambda_permission" "APIGetConfiguration" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getConfiguration"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGetConfigurationInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIGetEntryTypes will be created
  + resource "aws_lambda_permission" "APIGetEntryTypes" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getEntryTypes"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGetEntryTypesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIGetFilteringTerms will be created
  + resource "aws_lambda_permission" "APIGetFilteringTerms" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getFilteringTerms"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGetFilteringTermsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIGetInfo will be created
  + resource "aws_lambda_permission" "APIGetInfo" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getInfo"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGetInfoInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIGetProjects will be created
  + resource "aws_lambda_permission" "APIGetProjects" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getProjects"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGetProjectsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIGetinfo-root will be created
  + resource "aws_lambda_permission" "APIGetinfo-root" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getInfo"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGetinfoRootInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIGetmap will be created
  + resource "aws_lambda_permission" "APIGetmap" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getMap"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGetMapInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIadmin_proxy will be created
  + resource "aws_lambda_permission" "APIadmin_proxy" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-admin"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIadmin_proxyInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIanalyses will be created
  + resource "aws_lambda_permission" "APIanalyses" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getAnalyses"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIanalysesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIanalysesFilteringTerms will be created
  + resource "aws_lambda_permission" "APIanalysesFilteringTerms" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getAnalyses"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIanalysesFilteringTermsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIanalysesId will be created
  + resource "aws_lambda_permission" "APIanalysesId" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getAnalyses"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIanalysesIdInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIanalysesIdg_variants will be created
  + resource "aws_lambda_permission" "APIanalysesIdg_variants" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getAnalyses"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIanalysesIdg_variantsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIbiosamples will be created
  + resource "aws_lambda_permission" "APIbiosamples" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getBiosamples"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIbiosamplesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIbiosamplesFilteringTerms will be created
  + resource "aws_lambda_permission" "APIbiosamplesFilteringTerms" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getBiosamples"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIbiosamplesFilteringTermsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIbiosamplesId will be created
  + resource "aws_lambda_permission" "APIbiosamplesId" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getBiosamples"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIbiosamplesIdInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIbiosamplesIdanalyses will be created
  + resource "aws_lambda_permission" "APIbiosamplesIdanalyses" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getBiosamples"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIbiosamplesIdanalysesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIbiosamplesIdg_variants will be created
  + resource "aws_lambda_permission" "APIbiosamplesIdg_variants" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getBiosamples"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIbiosamplesIdg_variantsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIbiosamplesIdruns will be created
  + resource "aws_lambda_permission" "APIbiosamplesIdruns" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getBiosamples"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIbiosamplesIdrunsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIdatasets will be created
  + resource "aws_lambda_permission" "APIdatasets" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getDatasets"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIdatasetsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIdatasetsFilteringTerms will be created
  + resource "aws_lambda_permission" "APIdatasetsFilteringTerms" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getDatasets"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIdatasetsFilteringTermsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIdatasetsId will be created
  + resource "aws_lambda_permission" "APIdatasetsId" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getDatasets"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIdatasetsIdInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIdatasetsIdbiosamples will be created
  + resource "aws_lambda_permission" "APIdatasetsIdbiosamples" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getDatasets"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIdatasetsIdbiosamplesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIdatasetsIdfiltering_terms will be created
  + resource "aws_lambda_permission" "APIdatasetsIdfiltering_terms" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getDatasets"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIdatasetsIdfiltering_termsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIdatasetsIdg_variants will be created
  + resource "aws_lambda_permission" "APIdatasetsIdg_variants" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getDatasets"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIdatasetsIdg_variantsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIdatasetsIdindividuals will be created
  + resource "aws_lambda_permission" "APIdatasetsIdindividuals" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getDatasets"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIdatasetsIdindividualsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIdportal_proxy will be created
  + resource "aws_lambda_permission" "APIdportal_proxy" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-dataPortal"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIdportal_proxyInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIg_variants will be created
  + resource "aws_lambda_permission" "APIg_variants" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getGenomicVariants"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIg_variantsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIg_variantsId will be created
  + resource "aws_lambda_permission" "APIg_variantsId" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getGenomicVariants"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIg_variantsIdInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIg_variantsIdbiosamples will be created
  + resource "aws_lambda_permission" "APIg_variantsIdbiosamples" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getGenomicVariants"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIg_variantsIdbiosamplesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIg_variantsIdindividuals will be created
  + resource "aws_lambda_permission" "APIg_variantsIdindividuals" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getGenomicVariants"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIg_variantsIdindividualsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIindividuals will be created
  + resource "aws_lambda_permission" "APIindividuals" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getIndividuals"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIindividualsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIindividualsFilteringTerms will be created
  + resource "aws_lambda_permission" "APIindividualsFilteringTerms" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getIndividuals"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIindividualsFilteringTermsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIindividualsId will be created
  + resource "aws_lambda_permission" "APIindividualsId" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getIndividuals"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIindividualsIdInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIindividualsIdbiosamples will be created
  + resource "aws_lambda_permission" "APIindividualsIdbiosamples" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getIndividuals"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIindividualsIdbiosamplesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIindividualsIdg_variants will be created
  + resource "aws_lambda_permission" "APIindividualsIdg_variants" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getIndividuals"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIindividualsIdg_variantsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIruns will be created
  + resource "aws_lambda_permission" "APIruns" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getRuns"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIrunsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIrunsFilteringTerms will be created
  + resource "aws_lambda_permission" "APIrunsFilteringTerms" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getRuns"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIrunsFilteringTermsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIrunsId will be created
  + resource "aws_lambda_permission" "APIrunsId" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getRuns"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIrunsIdInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIrunsIdanalyses will be created
  + resource "aws_lambda_permission" "APIrunsIdanalyses" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getRuns"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIrunsIdanalysesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIrunsIdg_variants will be created
  + resource "aws_lambda_permission" "APIrunsIdg_variants" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getRuns"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIrunsIdg_variantsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.S3deidentifyFiles will be created
  + resource "aws_lambda_permission" "S3deidentifyFiles" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "SBeaconBackendAllowS3deidentifyFilesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.S3updateFiles will be created
  + resource "aws_lambda_permission" "S3updateFiles" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "SBeaconBackendAllowS3updateFilesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.SNSperformQuery will be created
  + resource "aws_lambda_permission" "SNSperformQuery" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "SBeaconBackendAllowSNSperformQueryInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.SNSsplitQuery will be created
  + resource "aws_lambda_permission" "SNSsplitQuery" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "SBeaconBackendAllowSNSsplitQueryInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_s3_bucket.dataportal-bucket will be created
  + resource "aws_s3_bucket" "dataportal-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "gasi-dataportal-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.sbeacon.aws_s3_bucket.lambda-layers-bucket will be created
  + resource "aws_s3_bucket" "lambda-layers-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "gasi-lambda-layers-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.sbeacon.aws_s3_bucket.metadata-bucket will be created
  + resource "aws_s3_bucket" "metadata-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "gasi-metadata-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.sbeacon.aws_s3_bucket.variants-bucket will be created
  + resource "aws_s3_bucket" "variants-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "gasi-variants-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.sbeacon.aws_s3_bucket_acl.dataportal_bucket_acl will be created
  + resource "aws_s3_bucket_acl" "dataportal_bucket_acl" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # module.sbeacon.aws_s3_bucket_acl.lambda-layers will be created
  + resource "aws_s3_bucket_acl" "lambda-layers" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # module.sbeacon.aws_s3_bucket_acl.metadata will be created
  + resource "aws_s3_bucket_acl" "metadata" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # module.sbeacon.aws_s3_bucket_acl.variants_bucket_acl will be created
  + resource "aws_s3_bucket_acl" "variants_bucket_acl" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # module.sbeacon.aws_s3_bucket_cors_configuration.dataportal-bucket will be created
  + resource "aws_s3_bucket_cors_configuration" "dataportal-bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "POST",
              + "PUT",
            ]
          + allowed_origins = [
              + "*",
            ]
          + expose_headers  = [
              + "ETag",
              + "x-amz-abort-date",
              + "x-amz-multipart-parts-count",
            ]
            id              = null
          + max_age_seconds = 36000
        }
    }

  # module.sbeacon.aws_s3_bucket_cors_configuration.metadata-bucket will be created
  + resource "aws_s3_bucket_cors_configuration" "metadata-bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "GET",
              + "HEAD",
            ]
          + allowed_origins = [
              + "*",
            ]
          + expose_headers  = []
            id              = null
          + max_age_seconds = 3000
        }
    }

  # module.sbeacon.aws_s3_bucket_lifecycle_configuration.metadata_bucket_lifecycle will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "metadata_bucket_lifecycle" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "clean-old-query-results"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 2
              + expired_object_delete_marker = false
            }

          + filter {
              + prefix = "query-results/"
            }
        }
      + rule {
          + id     = "clean-old-cached-results"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 2
              + expired_object_delete_marker = false
            }

          + filter {
              + prefix = "query-responses/"
            }
        }
    }

  # module.sbeacon.aws_s3_bucket_lifecycle_configuration.staging_bucket_lifecycle will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "staging_bucket_lifecycle" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "remove-zombie-staging-files"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 3
              + expired_object_delete_marker = false
            }

          + filter {
              + prefix = "staging/"
            }
        }
      + rule {
          + id     = "expire-noncurrent-versions"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + filter {
              + prefix = "staging/"
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 1
            }
        }
    }

  # module.sbeacon.aws_s3_bucket_lifecycle_configuration.variants_bucket_lifecycle will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "variants_bucket_lifecycle" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "clean-old-queries"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 1
              + expired_object_delete_marker = false
            }

          + filter {
              + prefix = "variant-queries/"
            }
        }
    }

  # module.sbeacon.aws_s3_bucket_notification.updateFiles will be created
  + resource "aws_s3_bucket_notification" "updateFiles" {
      + bucket      = (known after apply)
      + eventbridge = false
      + id          = (known after apply)

      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
              + "s3:ObjectRemoved:*",
            ]
          + filter_prefix       = "projects/"
          + id                  = (known after apply)
          + lambda_function_arn = (known after apply)
        }
      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix       = "staging/projects/"
          + id                  = (known after apply)
          + lambda_function_arn = (known after apply)
        }
    }

  # module.sbeacon.aws_s3_bucket_ownership_controls.dataportal_bucket_ownership_controls will be created
  + resource "aws_s3_bucket_ownership_controls" "dataportal_bucket_ownership_controls" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.sbeacon.aws_s3_bucket_ownership_controls.lambda_layers_bucket_ownership_controls will be created
  + resource "aws_s3_bucket_ownership_controls" "lambda_layers_bucket_ownership_controls" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.sbeacon.aws_s3_bucket_ownership_controls.metadata_bucket_ownership_controls will be created
  + resource "aws_s3_bucket_ownership_controls" "metadata_bucket_ownership_controls" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.sbeacon.aws_s3_bucket_ownership_controls.variants_bucket_ownership_controls will be created
  + resource "aws_s3_bucket_ownership_controls" "variants_bucket_ownership_controls" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.sbeacon.aws_s3_bucket_versioning.dataportal-bucket will be created
  + resource "aws_s3_bucket_versioning" "dataportal-bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.sbeacon.aws_sagemaker_notebook_instance_lifecycle_configuration.sagemaker_jupyter_instance_lcc will be created
  + resource "aws_sagemaker_notebook_instance_lifecycle_configuration" "sagemaker_jupyter_instance_lcc" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "clone-gaspi-notebooks"
      + on_create = "IyEvYmluL2Jhc2gKCnN1ZG8gdW5saW5rIC9ob21lL2VjMi11c2VyL3NhbXBsZS1ub3RlYm9va3MKZ2l0IGNsb25lIC0tZGVwdGggMSBodHRwczovL2dpdGh1Yi5jb20vR1NJLVhhcGllbnMtQ1NJUk8vR0FTUEktRVRMLW5vdGVib29rcy5naXQgL2hvbWUvZWMyLXVzZXIvR0FTUEktRVRMLW5vdGVib29rcwpzdWRvIGxuIC1zIC9ob21lL2VjMi11c2VyL0dBU1BJLUVUTC1ub3RlYm9va3MgL2hvbWUvZWMyLXVzZXIvc2FtcGxlLW5vdGVib29rcwoK"
      + on_start  = "IyEvYmluL2Jhc2gKCnN1ZG8gdW5saW5rIC9ob21lL2VjMi11c2VyL3NhbXBsZS1ub3RlYm9va3MKZ2l0IGNsb25lIC0tZGVwdGggMSBodHRwczovL2dpdGh1Yi5jb20vR1NJLVhhcGllbnMtQ1NJUk8vR0FTUEktRVRMLW5vdGVib29rcy5naXQgL2hvbWUvZWMyLXVzZXIvR0FTUEktRVRMLW5vdGVib29rcwpzdWRvIGxuIC1zIC9ob21lL2VjMi11c2VyL0dBU1BJLUVUTC1ub3RlYm9va3MgL2hvbWUvZWMyLXVzZXIvc2FtcGxlLW5vdGVib29rcwoK"
      + tags_all  = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.sbeacon.aws_sns_topic.performQuery will be created
  + resource "aws_sns_topic" "performQuery" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "performQuery"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tracing_config              = (known after apply)
    }

  # module.sbeacon.aws_sns_topic.splitQuery will be created
  + resource "aws_sns_topic" "splitQuery" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "splitQuery"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tracing_config              = (known after apply)
    }

  # module.sbeacon.aws_sns_topic_subscription.performQuery will be created
  + resource "aws_sns_topic_subscription" "performQuery" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.sbeacon.aws_sns_topic_subscription.splitQuery will be created
  + resource "aws_sns_topic_subscription" "splitQuery" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.sbeacon.null_resource.init_script will be created
  + resource "null_resource" "init_script" {
      + id       = (known after apply)
      + triggers = {
          + "script_hash" = "2fd01ae235e903cd1abfd015bc9151fcfd1d6322"
        }
    }

  # module.security.aws_wafv2_web_acl.security-all-cloudfront will be created
  + resource "aws_wafv2_web_acl" "security-all-cloudfront" {
      + application_integration_url = (known after apply)
      + arn                         = (known after apply)
      + capacity                    = (known after apply)
      + description                 = "WAF to be applied to all cloudfront distributions"
      + id                          = (known after apply)
      + lock_token                  = (known after apply)
      + name                        = "security-all-cloudfront"
      + name_prefix                 = (known after apply)
      + scope                       = "CLOUDFRONT"
      + tags_all                    = {
          + "Environment" = "uat"
          + "NAME"        = "security-infrastructure"
          + "Owner"       = "gaspi"
        }

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "security-all-cloudfront-IP-rate-limiting"
          + priority = 1

          + action {
              + block {
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type    = "IP"
                  + evaluation_window_sec = 300
                  + limit                 = 1000
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "security-all-cloudfront-IP-rate-limiting-rule-metric"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "security-all-cloudfront-common-ruleset"
          + priority = 2

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "security-all-cloudfront-common-ruleset-rule-metric"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "security-all-cloudfront-metric"
          + sampled_requests_enabled   = true
        }
    }

  # module.svep[0].data.archive_file.binaries_layer will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "binaries_layer" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "svep/binaries.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "svep/layers/binaries/"
      + type                = "zip"
    }

  # module.svep[0].data.aws_iam_policy_document.ec2_references_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ec2_references_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-clearTempAndRegions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-clearTempAndRegions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:DescribeStream",
              + "dynamodb:GetRecords",
              + "dynamodb:GetShardIterator",
              + "dynamodb:ListStreams",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-concat will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-concat" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-concatPages will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-concatPages" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-concatStarter will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-concatStarter" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-createPages will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-createPages" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-formatOutput will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-formatOutput" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-getResultsURL will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getResultsURL" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-initQuery will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-initQuery" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-pluginClinvar will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-pluginClinvar" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-pluginConsequence will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-pluginConsequence" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.